{
  "format": "layers-model",
  "generatedBy": "keras v2.15.0",
  "convertedBy": "TensorFlow.js Converter v4.9.0",
  "modelTopology": {
    "keras_version": "2.15.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Functional",
      "config": {
        "name": "model_1",
        "trainable": true,
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                18
              ],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "feature_input"
            },
            "name": "feature_input",
            "inbound_nodes": []
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization",
              "trainable": true,
              "dtype": "float32",
              "axis": [
                1
              ],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "gamma_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "moving_mean_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "moving_variance_initializer": {
                "module": "keras.initializers",
                "class_name": "Ones",
                "config": {},
                "registered_name": null
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization",
            "inbound_nodes": [
              [
                [
                  "feature_input",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_layer_0",
              "trainable": true,
              "dtype": "float32",
              "units": 512,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": {
                "module": "keras.regularizers",
                "class_name": "L1L2",
                "config": {
                  "l2": 0.009999999776482582
                },
                "registered_name": null
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense_layer_0",
            "inbound_nodes": [
              [
                [
                  "batch_normalization",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "TFOpLambda",
            "config": {
              "name": "tf.nn.relu_4",
              "trainable": true,
              "dtype": "float32",
              "function": "nn.relu"
            },
            "name": "tf.nn.relu_4",
            "inbound_nodes": [
              [
                "dense_layer_0",
                0,
                0,
                {
                  "name": null
                }
              ]
            ]
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_4",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.30000000000000004,
              "noise_shape": null,
              "seed": null
            },
            "name": "dropout_4",
            "inbound_nodes": [
              [
                [
                  "tf.nn.relu_4",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_layer_1",
              "trainable": true,
              "dtype": "float32",
              "units": 128,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": {
                "module": "keras.regularizers",
                "class_name": "L1L2",
                "config": {
                  "l2": 0.009999999776482582
                },
                "registered_name": null
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense_layer_1",
            "inbound_nodes": [
              [
                [
                  "dropout_4",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "TFOpLambda",
            "config": {
              "name": "tf.nn.relu_5",
              "trainable": true,
              "dtype": "float32",
              "function": "nn.relu"
            },
            "name": "tf.nn.relu_5",
            "inbound_nodes": [
              [
                "dense_layer_1",
                0,
                0,
                {
                  "name": null
                }
              ]
            ]
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_5",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.30000000000000004,
              "noise_shape": null,
              "seed": null
            },
            "name": "dropout_5",
            "inbound_nodes": [
              [
                [
                  "tf.nn.relu_5",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": "float32",
              "units": 3,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "dense_1",
            "inbound_nodes": [
              [
                [
                  "dropout_5",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          }
        ],
        "input_layers": [
          [
            "feature_input",
            0,
            0
          ]
        ],
        "output_layers": [
          [
            "dense_1",
            0,
            0
          ]
        ]
      }
    },
    "training_config": {
      "loss": "categorical_crossentropy",
      "metrics": [
        [
          {
            "class_name": "MeanMetricWrapper",
            "config": {
              "name": "accuracy",
              "dtype": "float32",
              "fn": "categorical_accuracy"
            }
          }
        ]
      ],
      "weighted_metrics": null,
      "loss_weights": null,
      "optimizer_config": {
        "class_name": "Custom>Nadam",
        "config": {
          "name": "Nadam",
          "weight_decay": null,
          "clipnorm": null,
          "global_clipnorm": null,
          "clipvalue": null,
          "use_ema": false,
          "ema_momentum": 0.99,
          "ema_overwrite_frequency": null,
          "jit_compile": false,
          "is_legacy_optimizer": false,
          "learning_rate": {
            "module": "keras.optimizers.schedules",
            "class_name": "ExponentialDecay",
            "config": {
              "initial_learning_rate": 0.0001,
              "decay_steps": 10000,
              "decay_rate": 0.9,
              "staircase": false,
              "name": null
            },
            "registered_name": null
          },
          "beta_1": 0.9,
          "beta_2": 0.999,
          "epsilon": 1e-07
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "batch_normalization/gamma",
          "shape": [
            18
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization/beta",
          "shape": [
            18
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization/moving_mean",
          "shape": [
            18
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization/moving_variance",
          "shape": [
            18
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/kernel",
          "shape": [
            128,
            3
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias",
          "shape": [
            3
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_layer_0/kernel",
          "shape": [
            18,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_layer_0/bias",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_layer_1/kernel",
          "shape": [
            512,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_layer_1/bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}